<script>
	import { characters } from '../stores/characters.store';

	import { onMount } from 'svelte';
	import EmblaCarousel from 'embla-carousel';

	onMount(() => {
		const emblaNode = document.querySelector('.embla');
		const options = { loop: true };

		embla = EmblaCarousel(emblaNode, options);
	});

	export let embla;
</script>

<section class="pb-8">
	<h1 class="text-4xl font-medium font-roboto">Тачки</h1>
	<p class="mt-2 text-xl font-montserrat">
		«Тачки» (англ. Cars) — американская полнометражная анимационная комедия 2006 года, 
		режиссёра Джона Лассетера, поставленная на студии Pixar. 
		Фильм был посвящён сорежиссёру Джо Рэнфту, который погиб на 45-м году жизни в автомобильной аварии 16 августа 2005 года. 
		Мультфильм вышел на экраны спустя 10 месяцев после гибели аниматора.
	</p>
	<div class="my-8">
		<img class="rounded-lg mx-auto w-11/12 md:w-9/12" src="/images/cars-poster-01.jpg" alt="">
	</div>
</section>

<section class="py-8">
	<h2 class="text-4xl font-medium font-roboto">Сюжет</h2>
	<p class="mt-2 text-xl font-montserrat">
		На земле, населённой антропоморфными говорящими машинами, финальная гонка Кубка Поршня заканчивается трехсторонней 
		ничьей между уходящим на пенсию ветераном Чипом «Кингом» Тюнингом, частым призёром Чико Хиксом и 
		дерзким новичком-сенсацией Молнией МакКуином; решающая гонка запланирована через неделю на международной автостраде в Калифорнии. 
		МакКуин отчаянно пытается выиграть гонку, ведь он не только станет первым новичком, выигравшим Кубок Поршня, 
		но он также сможет сменить непривлекательного спонсора Ржавейку, компанию по производству мазей для бамперов, 
		и занять место Кинга в престижной и прибыльной команде Диноко. Стремясь добраться до Калифорнии как можно скорее, 
		он торопит свой седельный автопоезд Мак, чтобы ехать всю ночь. Пока МакКуин спит, Мак задремал, а когда внезапно 
		проснулся, то МакКуин выпал с задней части трейлера на дорогу. МакКуин просыпается на оживленной дороге и съезжает 
		с шоссе в поисках Мака, но вместо этого попадает в заброшенный пустынный город Радиатор-Спрингс, где сильно повреждает главную дорогу.
	</p>
	<div class="my-8">
		<img class="rounded-lg mx-auto w-11/12 md:w-9/12" src="/images/cars-poster-02.jpg" alt="">
	</div>
	<p class="text-xl font-montserrat">
		На следующий день городской судья Док Хадсон приказывает МакКуину немедленно покинуть город, 
		но местный адвокат Салли просит назначить МакКуину общественные работы для ремонта дороги,
		на что Док неохотно соглашается. Все ещё спеша покинуть город, МакКуин некачественно 
		ремонтирует дорогу и получает указание отремонтировать её снова. За это время он 
		привязывается к городу и становится другом для нескольких его жителей. 
		Он узнает, что Радиатор-Спрингс когда-то был популярной остановкой на Трассе 66, пока его не обошла в обход 
		Система межштатных автомагистралей США, и в результате город оказался забыт. Также стало известно, 
		что Док был «Хадсоном Хорнетом», трехкратным чемпионом Кубка Поршня, карьера которого закончилась 
		преждевременно из-за серьёзной аварии. МакКуин привязывается к Салли, которая обрела счастье, 
		оставив быструю жизнь в Лос-Анджелесе, переехала в Радиатор-Спрингс и теперь мечтает вернуть город на карту. 
		МакКуин заканчивает ремонт дороги, воодушевляет жителей города и решает провести дополнительный день в 
		Радиатор-Спрингс со своими новыми друзьями, но его пребывание внезапно прерывается, когда в город приезжают Мак и СМИ. 
		МакКуин неохотно уезжает в Калифорнию, чтобы успеть к гонке, в то время как Салли злится на Дока, выяснив, 
		что он рассказал СМИ о местонахождении МакКуина.
	</p>
	<div class="my-8">
		<img class="rounded-lg mx-auto w-11/12 md:w-9/12" src="/images/cars-poster-03.jpg" alt="">
	</div>
	<p class="text-xl font-montserrat">
		На гонке МакКуин едет растерянно и вскоре оказывается на последнем месте. 
		Затем он с удивлением обнаруживает, что Док, поняв свою ошибку, занял место руководителя его команды, 
		а несколько других его друзей из Радиатор-Спрингс помогают на пит-стопе. Вдохновленный и вспомнив трюки, 
		которым он научился у Дока и его друзей, МакКуин выходит в лидеры, но на последнем круге Чико, 
		не желая снова проигрывать Кингу, ударяет по борту и отправляет Кинга в опасную аварию. 
		Вспоминая судьбу Дока, МакКуин останавливается совсем рядом с финишной чертой, позволяя 
		Чико победить, и возвращается, чтобы дотолкать Кинга за финишную черту. В результате разгневанная толпа и 
		СМИ осуждают победу Чико, но восхваляют спортивное поведение МакКуина. МакКуину предлагают спонсорство Диноко, 
		но он отказывается и остаётся с Ржавейкой из-за их поддержки в прошлом. Вернувшись в Радиатор-Спрингс, 
		МакКуин воссоединяется с Салли и объявляет, что он создаст в городе свою гоночную штаб-квартиру и тем самым вернет 
		Радиатор-Спрингс на карту, а также становится учеником Дока.
	</p>
</section>

<section class="py-8">
	<h2 class="mt-8 text-4xl font-medium font-roboto">Галерея</h2>
	<div class="mt-4 embla">
		<div class="embla__container">
			{#each $characters as character}
				{#each character.images.slides as slide}
					<div class="embla__slide">
						<img src="{slide}.webp" alt="" class="w-9/12 mx-auto rounded-lg">
					</div>
				{/each}
			{/each}
		</div>
	
		<div class="flex justify-center mt-4">
			<button class="px-4 py-2 mr-3 rounded-full border-2 border-gray-800" on:click="{embla.scrollPrev()}">Назад</button>
			<button class="px-4 py-2 rounded-full border-2 border-gray-800" on:click="{embla.scrollNext()}">Вперед</button>
		</div>
	</div>
</section>
